#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DevopsFiap/gh-actions/runs/run-49PzViVWMDWaAuwg

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=daring-monarch]
aws_iam_user.new_user: Refreshing state... [id=User_Fiap]
data.aws_ami.ubuntu: Refreshing...
aws_security_group.web-sg: Refreshing state... [id=sg-0b8d14ffa35667138]
data.aws_ami.ubuntu: Refresh complete after 0s [id=ami-02b71e4c18caedcb5]
aws_instance.web: Refreshing state... [id=i-0a6c536cb81da4bdf]
aws_iam_user_policy_attachment.new_user_policy_attachment: Refreshing state... [id=User_Fiap-20240924003054074400000001]
aws_iam_access_key.new_user_access_key: Refreshing state... [id=AKIAX4X7DKAXY5Y6GCMG]
aws_instance.web: Drift detected (delete)
aws_security_group.web-sg: Drift detected (update)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.web has been deleted
  - resource "aws_instance" "web" {
        id                                   = "i-0a6c536cb81da4bdf"
      - public_dns                           = "ec2-54-210-89-213.compute-1.amazonaws.com" -> null
        # (37 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_iam_access_key.new_user_access_key must be replaced
+/- resource "aws_iam_access_key" "new_user_access_key" {
      ~ create_date                    = "2024-09-24T00:30:54Z" -> (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      ~ id                             = "AKIAX4X7DKAXY5Y6GCMG" -> (known after apply)
      + key_fingerprint                = (known after apply)
      ~ secret                         = (sensitive value)
      ~ ses_smtp_password_v4           = (sensitive value)
      ~ user                           = "User_Fiap" -> "Usuario_Impacta_ES27" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_user.new_user will be updated in-place
  ~ resource "aws_iam_user" "new_user" {
        id            = "User_Fiap"
      ~ name          = "User_Fiap" -> "Usuario_Impacta_ES27"
      ~ tags          = {
          ~ "Name" = "Example User" -> "AS08"
        }
      ~ tags_all      = {
          ~ "Name" = "Example User" -> "AS08"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_user_policy_attachment.new_user_policy_attachment must be replaced
-/+ resource "aws_iam_user_policy_attachment" "new_user_policy_attachment" {
      ~ id         = "User_Fiap-20240924003054074400000001" -> (known after apply)
      ~ user       = "User_Fiap" -> "Usuario_Impacta_ES27" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-02b71e4c18caedcb5"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "30a8f39ebf6ec03c89f9d901a9271811058c36f9"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0b8d14ffa35667138",
        ]

      + capacity_reservation_specification (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ web-address = "ec2-54-210-89-213.compute-1.amazonaws.com:8080" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @FABIANO-DA-SILVA-CARNEIRO, Action: `pull_request`*